module.exports = {
  title: '结构型模式',
  path: '/程序设计/设计模式/结构型模式/',
  children: [
    {
      title: '适配器模式',
      path: '/程序设计/设计模式/结构型模式/适配器模式/'
    },
    {
      title: '桥接模式',
      path: '/程序设计/设计模式/结构型模式/桥接模式/'
    },
    {
      title: '过滤器模式',
      path: '/程序设计/设计模式/结构型模式/过滤器模式/'
    },
    {
      title: '组合模式',
      path: '/程序设计/设计模式/结构型模式/组合模式/'
    },
    {
      title: '装饰器模式',
      path: '/程序设计/设计模式/结构型模式/装饰器模式/'
    },
    {
      title: '外观模式',
      path: '/程序设计/设计模式/结构型模式/外观模式/'
    },
    {
      title: '享元模式',
      path: '/程序设计/设计模式/结构型模式/享元模式/'
    },
    {
      title: '代理模式',
      path: '/程序设计/设计模式/结构型模式/代理模式/'
    }
  ]
};
