module.exports = {
  title: '数据结构',
  path: '/编程语言/Lua/基础篇/数据结构/',
  children: [
    {
      title: '数组',
      path: '/编程语言/Lua/基础篇/数据结构/数组/'
    },
    {
      title: '矩阵及多维数组',
      path: '/编程语言/Lua/基础篇/数据结构/矩阵及多维数组/'
    },
    {
      title: '链表',
      path: '/编程语言/Lua/基础篇/数据结构/链表/'
    },
    {
      title: '队列及双端队列',
      path: '/编程语言/Lua/基础篇/数据结构/队列及双端队列/'
    },
    {
      title: '反向表',
      path: '/编程语言/Lua/基础篇/数据结构/反向表/'
    },
    {
      title: '集合与包',
      path: '/编程语言/Lua/基础篇/数据结构/集合与包/'
    },
    {
      title: '字符串缓冲区',
      path: '/编程语言/Lua/基础篇/数据结构/字符串缓冲区/'
    },
    {
      title: '图形',
      path: '/编程语言/Lua/基础篇/数据结构/图形/'
    }
  ]
};
