module.exports = {
  title: '表相关的元方法',
  path: '/编程语言/Lua/基础篇/元表和元方法/表相关的元方法/',
  children: [
    {
      title: '__index 元方法',
      path: '/编程语言/Lua/基础篇/元表和元方法/表相关的元方法/__index元方法'
    },
    {
      title: '___newindex 元方法',
      path: '/编程语言/Lua/基础篇/元表和元方法/表相关的元方法/__newindex元方法'
    },
    {
      title: '具有默认值的表',
      path: '/编程语言/Lua/基础篇/元表和元方法/表相关的元方法/具有默认值的表'
    },
    {
      title: '跟踪对表的访问',
      path: '/编程语言/Lua/基础篇/元表和元方法/表相关的元方法/跟踪对表的访问'
    },
    {
      title: '只读的表',
      path: '/编程语言/Lua/基础篇/元表和元方法/表相关的元方法/只读的表'
    }
  ]
};
