module.exports = {
  title: 'J2EE模式',
  path: '/程序设计/设计模式/J2EE模式/',
  children: [
    {
      title: 'MVC模式',
      path: '/程序设计/设计模式/J2EE模式/MVC模式/'
    },
    {
      title: '业务代表模式',
      path: '/程序设计/设计模式/J2EE模式/业务代表模式/'
    },
    {
      title: '组合实体模式',
      path: '/程序设计/设计模式/J2EE模式/组合实体模式/'
    },
    {
      title: '数据访问对象模式',
      path: '/程序设计/设计模式/J2EE模式/数据访问对象模式/'
    },
    {
      title: '前端控制器模式',
      path: '/程序设计/设计模式/J2EE模式/前端控制器模式/'
    },
    {
      title: '拦截过滤器模式',
      path: '/程序设计/设计模式/J2EE模式/拦截过滤器模式/'
    },
    {
      title: '服务定位器模式',
      path: '/程序设计/设计模式/J2EE模式/服务定位器模式/'
    },
    {
      title: '传输对象模式',
      path: '/程序设计/设计模式/J2EE模式/传输对象模式/'
    }
  ]
};
