module.exports = {
  title: '行为型模式',
  path: '/程序设计/设计模式/行为型模式/',
  children: [
    {
      title: '责任链模式',
      path: '/程序设计/设计模式/行为型模式/责任链模式/'
    },
    {
      title: '命令模式',
      path: '/程序设计/设计模式/行为型模式/命令模式/'
    },
    {
      title: '解释器模式',
      path: '/程序设计/设计模式/行为型模式/解释器模式/'
    },
    {
      title: '迭代器模式',
      path: '/程序设计/设计模式/行为型模式/迭代器模式/'
    },
    {
      title: '中介者模式',
      path: '/程序设计/设计模式/行为型模式/中介者模式/'
    },
    {
      title: '备忘录模式',
      path: '/程序设计/设计模式/行为型模式/备忘录模式/'
    },
    {
      title: '观察者模式',
      path: '/程序设计/设计模式/行为型模式/观察者模式/'
    },
    {
      title: '状态模式',
      path: '/程序设计/设计模式/行为型模式/状态模式/'
    },
    {
      title: '空对象模式',
      path: '/程序设计/设计模式/行为型模式/空对象模式/'
    },
    {
      title: '策略模式',
      path: '/程序设计/设计模式/行为型模式/策略模式/'
    },
    {
      title: '模板模式',
      path: '/程序设计/设计模式/行为型模式/模板模式/'
    },
    {
      title: '访问者模式',
      path: '/程序设计/设计模式/行为型模式/访问者模式/'
    }
  ]
};
